#include <iostream>
using namespace std;

int main()
{
	int n; // 좌석 선택 유무 판단
	int i, j; // 선택할 좌석 변수 선언
	int h, k; // 인덱스에 들어갈 변수 선언
	int arr[3][10]{ 0 };

	while (1)
	{
		cout << "좌석을 예약하시겠습니까? (0이나 1 선택)  ";
		cin >> n;

		if (n == 1)// 좌석 예약 
		{
			cout << "---------------------------------------------" << endl;
			cout << "1 2 3 4 5 6 7 8 9 10" << endl;
			cout << "---------------------------------------------" << endl;
			for (h = 0; h < 3; h++) // 반복문 사용
			{
				for (k = 0; k < 10; k++)
				{
					cout << arr[h][k] << " ";
				}
				cout << endl;
			}
			cout << "몇 열, 몇 번째 좌석을 예약하시겠습니까?  ";
			cin >> i >> j;
			if (arr[i - 1][j - 1] == 0) //배열의 인덱스는 0부터 시작하므로 입력값에서 1을 뺀 값이 들어가야한다.
			{
				cout << "\n예약되었습니다." << endl;
				cout << "---------------------------------------------" << endl;
				cout << "1 2 3 4 5 6 7 8 9 10" << endl;
				cout << "---------------------------------------------" << endl;
				arr[i - 1][j - 1] = 1; // 선택한 자리의 값을 1로 바꾼다.
				for (h = 0; h < 3; h++)
				{
					for (k = 0; k < 10; k++)
					{
						cout << arr[h][k] << " ";
					}
					cout << endl;
				}


			}
			else // 예약된 자리를 선택했을 때
			{
				cout << "이미 예약된 자리입니다." << endl;
			}
		}

		else if (n == 0) //좌석 예약 안할 때
		{

			cout << "좌석 예약 종료" << endl;
			break;

		}


	}
	return 0;
}